# GetLayoutDialogSize

## Description
Retrieves a Layout Manager dialog's size, in pixels.

```pascal
PROCEDURE GetLayoutDialogSize(
				dialogID   : LONGINT;
				VAR width  : INTEGER;
				VAR height : INTEGER);
```

```python

def vs.GetLayoutDialogSize(dialogID):
    return (width, height)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|width|INTEGER||
|height|INTEGER||

## Version
Availability: from VectorWorks12.0
## Category
* Dialogs - Modern